app/views/businesses/show.html.erb

SELECT "menus".* FROM "menus" WHERE "menus"."business_id" = 3
---

<% @business.menus.each do |menu| %>

SELECT "items".* FROM "items" WHERE "items"."menu_id" IN (19, 20, 21)
SELECT 1 AS one FROM "items" WHERE "items"."menu_id" = 66 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."menu_id" = 66
---

  <% if menu.items.any? %>
    <ul>
      <% menu.items.each do |item| %>