app/views/admin/businesses/show.html.erb

<%# Boucle sur les menus "racine" (ex: "Fin de semaine") %>
<% @business.menus.each do |root_menu| %>
---
SELECT "menus".* FROM "menus" WHERE "menus"."business_id" = 3

          <%# Affiche les items DANS le sous-menu %>
          <% if sub_menu.items.any? %>
            <ul>
              <% sub_menu.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."menu_id" = 46
SELECT 1 AS one FROM "items" WHERE "items"."menu_id" = 62 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."menu_id" = 62