app/controllers/admin/businesses_controller.rb

SELECT "businesses".* FROM "businesses" ORDER BY "businesses"."name" DESC
---
  def index
    @businesses = Business.order(name: :desc)

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 3 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."menu_id" IN (1, 2, 3, 4)
---
  def set_business
    # --- MODIFICATION ICI --- (sub_menus -> menus)
    @business = Business.includes(menus: [:items, { menus: :items }]).find(params[:id])