app/controllers/admin/businesses_controller.rb

  def set_business
    @business = Business.includes(:menus).find(params[:id])
---
SELECT "menus".* FROM "menus" WHERE "menus"."business_id" = 7