app/views/my_menus/index.html.erb

SELECT "menus".* FROM "menus" WHERE "menus"."business_id" IN (8, 10, 9, 6, 7)
SELECT 1 AS one FROM "menus" WHERE "menus"."business_id" = 8 AND "menus"."parent_id" IS NULL LIMIT 1
---
      <%# Vérifie si ce restaurant a des menus %>
      <% if business.menus.where(parent_id: nil).any? %>

SELECT "menus".* FROM "menus" WHERE "menus"."business_id" = 8 AND "menus"."parent_id" IS NULL
---
        <ul>
          <% business.menus.where(parent_id: nil).each do |menu| %>