app/views/my_menus/show.html.erb


<% @business.menus.where(parent_id: nil).each do |root_menu| %>
---
SELECT "menus".* FROM "menus" WHERE "menus"."business_id" = 8 AND "menus"."parent_id" IS NULL


      <% if sub_menu.items.any? %>
---
SELECT 1 AS one FROM "items" WHERE "items"."menu_id" = 29 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."menu_id" = 30