app/controllers/businesses_controller.rb

  def index
    if user_signed_in? && !current_user.admin?
      # affiche seulement businesses du user
      @businesses = current_user.businesses.includes(:menus).order(name: :asc)
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."user_id" = 2 ORDER BY "businesses"."name" ASC
SELECT "menus".* FROM "menus" WHERE "menus"."business_id" IN (8, 10, 9, 6, 7)

  def show
    @business = Business
    .includes(menus: [:items, { menus: :items }])
    .find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."menu_id" = 17

  def set_business
    if user_signed_in? && !current_user.admin?
      # Affiche seulement business du user
      @business = current_user.businesses.includes(:menus).find(params[:id])
    else
      @business = Business.includes(:menus).find(params[:id])
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 5 LIMIT 1
SELECT "menus".* FROM "menus" WHERE "menus"."business_id" = 5
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 17 LIMIT 1
SELECT "menus".* FROM "menus" WHERE "menus"."business_id" = 17