app/controllers/businesses_controller.rb

SELECT "items".* FROM "items" WHERE "items"."menu_id" IN (21, 25, 29, 33, 37, 22, 23, 24, 26, 27, 28, 30, 31, 32, 34, 35, 36, 38, 39, 40)
---
  def index
    if user_signed_in? && !current_user.admin?
      # affiche seulement businesses du user
      @businesses = current_user.businesses.includes(menus: [:items, { menus: :items }]).order(name: :asc)

SELECT "items".* FROM "items" WHERE "items"."menu_id" IN (65, 66, 67, 68)
SELECT "items".* FROM "items" WHERE "items"."menu_id" IN (17, 18, 19, 20)
---
  def set_business
    if user_signed_in? && !current_user.admin?
      # Affiche seulement business du user
      @business = current_user.businesses.includes(menus: [:items, { menus: :items }]).find(params[:id])
    else
      @business = Business.includes(menus: [:items, { menus: :items }]).find(params[:id])