app/controllers/my_menus_controller.rb

  def index
    # Titre de la page
    @page_title = "Mes Restaurants"

    # 3. On cherche les entreprises (businesses) SEULEMENT parmi
    #    celles qui appartiennent au 'current_user'.
    @businesses = current_user.businesses.includes(:menus).order(:name)
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."user_id" = 2 ORDER BY "businesses"."name" ASC
SELECT "menus".* FROM "menus" WHERE "menus"."business_id" IN (8, 10, 9, 6, 7)

  def set_business
    # 4. On cherche le restaurant par son ID, mais en s'assurant
    #    qu'il appartient bien à l'utilisateur connecté.
    @business = current_user.businesses.includes(menus: [:items, { menus: :items }]).find_by(id: params[:id])
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."user_id" = 2 AND "businesses"."id" = 8 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."menu_id" IN (29, 30, 31, 32)